STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp211cxx_cm33.h
#define HPDMA1_Channel6             HPDMA1_Channel6_NS
#define HPDMA1_Channel6_BASE        HPDMA1_Channel6_BASE_NS

#define HPDMA1_Channel7             HPDMA1_Channel7_NS
#define HPDMA1_Channel7_BASE        HPDMA1_Channel7_BASE_NS

#define HPDMA1_Channel8             HPDMA1_Channel8_NS
#define HPDMA1_Channel8_BASE        HPDMA1_Channel8_BASE_NS

#define HPDMA1_Channel9             HPDMA1_Channel9_NS
#define HPDMA1_Channel9_BASE        HPDMA1_Channel9_BASE_NS

#define HPDMA1_Channel10            HPDMA1_Channel10_NS
#define HPDMA1_Channel10_BASE       HPDMA1_Channel10_BASE_NS

#define HPDMA1_Channel11            HPDMA1_Channel11_NS
#define HPDMA1_Channel11_BASE       HPDMA1_Channel11_BASE_NS

#define HPDMA1_Channel12            HPDMA1_Channel12_NS
#define HPDMA1_Channel12_BASE       HPDMA1_Channel12_BASE_NS

#define HPDMA1_Channel13            HPDMA1_Channel13_NS
#define HPDMA1_Channel13_BASE       HPDMA1_Channel13_BASE_NS

#define HPDMA1_Channel14            HPDMA1_Channel14_NS
#define HPDMA1_Channel14_BASE       HPDMA1_Channel14_BASE_NS

#define HPDMA1_Channel15            HPDMA1_Channel15_NS
#define HPDMA1_Channel15_BASE       HPDMA1_Channel15_BASE_NS

#define HPDMA2_Channel0             HPDMA2_Channel0_NS
#define HPDMA2_Channel0_BASE        HPDMA2_Channel0_BASE_NS

#define HPDMA2_Channel1             HPDMA2_Channel1_NS
#define HPDMA2_Channel1_BASE        HPDMA2_Channel1_BASE_NS

#define HPDMA2_Channel2             HPDMA2_Channel2_NS
#define HPDMA2_Channel2_BASE        HPDMA2_Channel2_BASE_NS

#define HPDMA2_Channel3             HPDMA2_Channel3_NS
#define HPDMA2_Channel3_BASE        HPDMA2_Channel3_BASE_NS

#define HPDMA2_Channel4             HPDMA2_Channel4_NS
#define HPDMA2_Channel4_BASE        HPDMA2_Channel4_BASE_NS

#define HPDMA2_Channel5             HPDMA2_Channel5_NS
#define HPDMA2_Channel5_BASE        HPDMA2_Channel5_BASE_NS

#define HPDMA2_Channel6             HPDMA2_Channel6_NS
#define HPDMA2_Channel6_BASE        HPDMA2_Channel6_BASE_NS

#define HPDMA2_Channel7             HPDMA2_Channel7_NS
#define HPDMA2_Channel7_BASE        HPDMA2_Channel7_BASE_NS

#define HPDMA2_Channel8             HPDMA2_Channel8_NS
#define HPDMA2_Channel8_BASE        HPDMA2_Channel8_BASE_NS

#define HPDMA2_Channel9             HPDMA2_Channel9_NS
#define HPDMA2_Channel9_BASE        HPDMA2_Channel9_BASE_NS

#define HPDMA2_Channel10            HPDMA2_Channel10_NS
#define HPDMA2_Channel10_BASE       HPDMA2_Channel10_BASE_NS

#define HPDMA2_Channel11            HPDMA2_Channel11_NS
#define HPDMA2_Channel11_BASE       HPDMA2_Channel11_BASE_NS

#define HPDMA2_Channel12            HPDMA2_Channel12_NS
#define HPDMA2_Channel12_BASE       HPDMA2_Channel12_BASE_NS

#define HPDMA2_Channel13            HPDMA2_Channel13_NS
#define HPDMA2_Channel13_BASE       HPDMA2_Channel13_BASE_NS

#define HPDMA2_Channel14            HPDMA2_Channel14_NS
#define HPDMA2_Channel14_BASE       HPDMA2_Channel14_BASE_NS

#define HPDMA2_Channel15            HPDMA2_Channel15_NS
#define HPDMA2_Channel15_BASE       HPDMA2_Channel15_BASE_NS

#define HPDMA3_Channel0             HPDMA3_Channel0_NS
#define HPDMA3_Channel0_BASE        HPDMA3_Channel0_BASE_NS

#define HPDMA3_Channel1             HPDMA3_Channel1_NS
#define HPDMA3_Channel1_BASE        HPDMA3_Channel1_BASE_NS

#define HPDMA3_Channel2             HPDMA3_Channel2_NS
#define HPDMA3_Channel2_BASE        HPDMA3_Channel2_BASE_NS

#define HPDMA3_Channel3             HPDMA3_Channel3_NS
#define HPDMA3_Channel3_BASE        HPDMA3_Channel3_BASE_NS

#define HPDMA3_Channel4             HPDMA3_Channel4_NS
#define HPDMA3_Channel4_BASE        HPDMA3_Channel4_BASE_NS

#define HPDMA3_Channel5             HPDMA3_Channel5_NS
#define HPDMA3_Channel5_BASE        HPDMA3_Channel5_BASE_NS

#define HPDMA3_Channel6             HPDMA3_Channel6_NS
#define HPDMA3_Channel6_BASE        HPDMA3_Channel6_BASE_NS

#define HPDMA3_Channel7             HPDMA3_Channel7_NS
#define HPDMA3_Channel7_BASE        HPDMA3_Channel7_BASE_NS

#define HPDMA3_Channel8             HPDMA3_Channel8_NS
#define HPDMA3_Channel8_BASE        HPDMA3_Channel8_BASE_NS

#define HPDMA3_Channel9             HPDMA3_Channel9_NS
#define HPDMA3_Channel9_BASE        HPDMA3_Channel9_BASE_NS

#define HPDMA3_Channel10            HPDMA3_Channel10_NS
#define HPDMA3_Channel10_BASE       HPDMA3_Channel10_BASE_NS

#define HPDMA3_Channel11            HPDMA3_Channel11_NS
#define HPDMA3_Channel11_BASE       HPDMA3_Channel11_BASE_NS

#define HPDMA3_Channel12            HPDMA3_Channel12_NS
#define HPDMA3_Channel12_BASE       HPDMA3_Channel12_BASE_NS

#define HPDMA3_Channel13            HPDMA3_Channel13_NS
#define HPDMA3_Channel13_BASE       HPDMA3_Channel13_BASE_NS

#define HPDMA3_Channel14            HPDMA3_Channel14_NS
#define HPDMA3_Channel14_BASE       HPDMA3_Channel14_BASE_NS

#define HPDMA3_Channel15            HPDMA3_Channel15_NS
#define HPDMA3_Channel15_BASE       HPDMA3_Channel15_BASE_NS

/*!< AHB3 peripherals defaults to Non secure aliases */
#define HASH1                       HASH1_NS
#define HASH1_BASE                  HASH1_BASE_NS

#define HASH1_DIGEST                HASH1_DIGEST_NS
#define HASH1_DIGEST_BASE           HASH1_DIGEST_BASE_NS

#define HASH2                       HASH2_NS
#define HASH2_BASE                  HASH2_BASE_NS

#define HASH2_DIGEST                HASH2_DIGEST_NS
#define HASH2_DIGEST_BASE           HASH2_DIGEST_BASE_NS

#define RNG1                        RNG1_NS
#define RNG1_BASE                   RNG1_BASE_NS

#define RNG2                        RNG2_NS
#define RNG2_BASE                   RNG2_BASE_NS

#define CRYP1                       CRYP1_NS
#define CRYP1_BASE                  CRYP1_BASE_NS

#define CRYP2                       CRYP2_NS
#define CRYP2_BASE                  CRYP2_BASE_NS

#define SAES                        SAES_NS
#define SAES_BASE                   SAES_BASE_NS

#define PKA                         PKA_NS
#define PKA_BASE                    PKA_BASE_NS

#define RAMCFG                      RAMCFG_NS
#define RAMCFG_BASE                 RAMCFG_BASE_NS

#define RAMCFG_SYSRAM               RAMCFG_SYSRAM_NS
#define RAMCFG_SYSRAM_BASE          RAMCFG_SYSRAM_BASE_NS

#define RAMCFG_SRAM1                RAMCFG_SRAM1_NS
#define RAMCFG_SRAM1_BASE           RAMCFG_SRAM1_BASE_NS

#define RAMCFG_SRAM2                RAMCFG_SRAM2_NS
#define RAMCFG_SRAM2_BASE           RAMCFG_SRAM2_BASE_NS

#define RAMCFG_RETRAM               RAMCFG_RETRAM_NS
#define RAMCFG_RETRAM_BASE          RAMCFG_RETRAM_BASE_NS

#define RAMCFG_BKPSRAM              RAMCFG_BKPSRAM_NS
#define RAMCFG_BKPSRAM_BASE         RAMCFG_BKPSRAM_BASE_NS


#define RIFSC                       RIFSC_NS
#define RIFSC_BASE                  RIFSC_BASE_NS

#define RISC                        RISC_NS
#define RISC_BASE                   RISC_BASE_NS

