STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp211cxx_cm33.h
/* Bit fields for RCC_DCMIPPCFGR register */
#define RCC_DCMIPPCFGR_DCMIPPRST_Pos               (0U)
#define RCC_DCMIPPCFGR_DCMIPPRST_Msk               (0x1UL << RCC_DCMIPPCFGR_DCMIPPRST_Pos)              /*!< 0x00000001 */
#define RCC_DCMIPPCFGR_DCMIPPRST                   RCC_DCMIPPCFGR_DCMIPPRST_Msk                      /*!< DCMIPP reset */
#define RCC_DCMIPPCFGR_DCMIPPEN_Pos                (1U)
#define RCC_DCMIPPCFGR_DCMIPPEN_Msk                (0x1UL << RCC_DCMIPPCFGR_DCMIPPEN_Pos)               /*!< 0x00000002 */
#define RCC_DCMIPPCFGR_DCMIPPEN                    RCC_DCMIPPCFGR_DCMIPPEN_Msk                       /*!< DCMIPP clock enable */
#define RCC_DCMIPPCFGR_DCMIPPLPEN_Pos              (2U)
#define RCC_DCMIPPCFGR_DCMIPPLPEN_Msk              (0x1UL << RCC_DCMIPPCFGR_DCMIPPLPEN_Pos)             /*!< 0x00000004 */
#define RCC_DCMIPPCFGR_DCMIPPLPEN                  RCC_DCMIPPCFGR_DCMIPPLPEN_Msk                     /*!< DCMIPP clock enable during CSleep */

/***************  Bit fields for RCC_DCMIPSSICFGR register  ***************/
#define RCC_DCMIPSSICFGR_DCMIPSSIRST_Pos           (0U)
#define RCC_DCMIPSSICFGR_DCMIPSSIRST_Msk           (0x1UL << RCC_DCMIPSSICFGR_DCMIPSSIRST_Pos)          /*!< 0x00000001 */
#define RCC_DCMIPSSICFGR_DCMIPSSIRST               RCC_DCMIPSSICFGR_DCMIPSSIRST_Msk                    /*!< DCMIPSSI reset */
#define RCC_DCMIPSSICFGR_DCMIPSSIEN_Pos            (1U)
#define RCC_DCMIPSSICFGR_DCMIPSSIEN_Msk            (0x1UL << RCC_DCMIPSSICFGR_DCMIPSSIEN_Pos)           /*!< 0x00000002 */
#define RCC_DCMIPSSICFGR_DCMIPSSIEN                RCC_DCMIPSSICFGR_DCMIPSSIEN_Msk                   /*!< DCMIPSSI clock enable */
#define RCC_DCMIPSSICFGR_DCMIPSSILPEN_Pos          (2U)
#define RCC_DCMIPSSICFGR_DCMIPSSILPEN_Msk          (0x1UL << RCC_DCMIPSSICFGR_DCMIPSSILPEN_Pos)         /*!< 0x00000004 */
#define RCC_DCMIPSSICFGR_DCMIPSSILPEN              RCC_DCMIPSSICFGR_DCMIPSSILPEN_Msk                   /*!< DCMIPSSI clock enable during CSleep */

/* Bit fields for RCC_RNG1CFGR register */
#define RCC_RNG1CFGR_RNG1RST_Pos                   (0U)
#define RCC_RNG1CFGR_RNG1RST_Msk                   (0x1UL << RCC_RNG1CFGR_RNG1RST_Pos)                  /*!< 0x00000001 */
#define RCC_RNG1CFGR_RNG1RST                       RCC_RNG1CFGR_RNG1RST_Msk                          /*!< RNG1 reset */
#define RCC_RNG1CFGR_RNG1EN_Pos                    (1U)
#define RCC_RNG1CFGR_RNG1EN_Msk                    (0x1UL << RCC_RNG1CFGR_RNG1EN_Pos)                   /*!< 0x00000002 */
#define RCC_RNG1CFGR_RNG1EN                        RCC_RNG1CFGR_RNG1EN_Msk                           /*!< RNG1 clock enable */
#define RCC_RNG1CFGR_RNG1LPEN_Pos                  (2U)
#define RCC_RNG1CFGR_RNG1LPEN_Msk                  (0x1UL << RCC_RNG1CFGR_RNG1LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_RNG1CFGR_RNG1LPEN                      RCC_RNG1CFGR_RNG1LPEN_Msk                         /*!< RNG1 clock enable during CSleep */

/* Bit fields for RCC_RNG2CFGR register */
#define RCC_RNG2CFGR_RNG2RST_Pos                   (0U)
#define RCC_RNG2CFGR_RNG2RST_Msk                   (0x1UL << RCC_RNG2CFGR_RNG2RST_Pos)                  /*!< 0x00000001 */
#define RCC_RNG2CFGR_RNG2RST                       RCC_RNG2CFGR_RNG2RST_Msk                          /*!< RNG2 reset */
#define RCC_RNG2CFGR_RNG2EN_Pos                    (1U)
#define RCC_RNG2CFGR_RNG2EN_Msk                    (0x1UL << RCC_RNG2CFGR_RNG2EN_Pos)                   /*!< 0x00000002 */
#define RCC_RNG2CFGR_RNG2EN                        RCC_RNG2CFGR_RNG2EN_Msk                           /*!< RNG2 clock enable */
#define RCC_RNG2CFGR_RNG2LPEN_Pos                  (2U)
#define RCC_RNG2CFGR_RNG2LPEN_Msk                  (0x1UL << RCC_RNG2CFGR_RNG2LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_RNG2CFGR_RNG2LPEN                      RCC_RNG2CFGR_RNG2LPEN_Msk                         /*!< RNG2 clock enable during CSleep */

/* Bit fields for RCC_PKACFGR register  ******************/
#define RCC_PKACFGR_PKARST_Pos                   (0U)
#define RCC_PKACFGR_PKARST_Msk                   (0x1UL << RCC_PKACFGR_PKARST_Pos)                    /*!< 0x00000001 */
#define RCC_PKACFGR_PKARST                       RCC_PKACFGR_PKARST_Msk                            /*!< PKA reset */
#define RCC_PKACFGR_PKAEN_Pos                    (1U)
#define RCC_PKACFGR_PKAEN_Msk                    (0x1UL << RCC_PKACFGR_PKAEN_Pos)                   /*!< 0x00000002 */
#define RCC_PKACFGR_PKAEN                        RCC_PKACFGR_PKAEN_Msk                             /*!< PKA clock enable */
#define RCC_PKACFGR_PKALPEN_Pos                  (2U)
#define RCC_PKACFGR_PKALPEN_Msk                  (0x1UL << RCC_PKACFGR_PKALPEN_Pos)                   /*!< 0x00000004 */
#define RCC_PKACFGR_PKALPEN                      RCC_PKACFGR_PKALPEN_Msk                           /*!< PKA clock enable during CSleep */

/* Bit fields for RCC_SAESCFGR register */
#define RCC_SAESCFGR_SAESRST_Pos                   (0U)
#define RCC_SAESCFGR_SAESRST_Msk                   (0x1UL << RCC_SAESCFGR_SAESRST_Pos)                  /*!< 0x00000001 */
#define RCC_SAESCFGR_SAESRST                       RCC_SAESCFGR_SAESRST_Msk                          /*!< SAES reset */
#define RCC_SAESCFGR_SAESEN_Pos                    (1U)
#define RCC_SAESCFGR_SAESEN_Msk                    (0x1UL << RCC_SAESCFGR_SAESEN_Pos)                   /*!< 0x00000002 */
#define RCC_SAESCFGR_SAESEN                        RCC_SAESCFGR_SAESEN_Msk                           /*!< SAES clock enable */
#define RCC_SAESCFGR_SAESLPEN_Pos                  (2U)
#define RCC_SAESCFGR_SAESLPEN_Msk                  (0x1UL << RCC_SAESCFGR_SAESLPEN_Pos)                 /*!< 0x00000004 */
#define RCC_SAESCFGR_SAESLPEN                      RCC_SAESCFGR_SAESLPEN_Msk                         /*!< SAES clock enable during CSleep */

/* Bit fields for RCC_HASH1CFGR register */
#define RCC_HASH1CFGR_HASH1RST_Pos                 (0U)
#define RCC_HASH1CFGR_HASH1RST_Msk                 (0x1UL << RCC_HASH1CFGR_HASH1RST_Pos)                /*!< 0x00000001 */
#define RCC_HASH1CFGR_HASH1RST                     RCC_HASH1CFGR_HASH1RST_Msk                        /*!< HASH1 reset */
#define RCC_HASH1CFGR_HASH1EN_Pos                  (1U)
#define RCC_HASH1CFGR_HASH1EN_Msk                  (0x1UL << RCC_HASH1CFGR_HASH1EN_Pos)                 /*!< 0x00000002 */
#define RCC_HASH1CFGR_HASH1EN                      RCC_HASH1CFGR_HASH1EN_Msk                         /*!< HASH1 clock enable */
#define RCC_HASH1CFGR_HASH1LPEN_Pos                (2U)
#define RCC_HASH1CFGR_HASH1LPEN_Msk                (0x1UL << RCC_HASH1CFGR_HASH1LPEN_Pos)               /*!< 0x00000004 */
#define RCC_HASH1CFGR_HASH1LPEN                    RCC_HASH1CFGR_HASH1LPEN_Msk                       /*!< HASH1 clock enable during CSleep */

/* Bit fields for RCC_HASH2CFGR register */
#define RCC_HASH2CFGR_HASH2RST_Pos                 (0U)
#define RCC_HASH2CFGR_HASH2RST_Msk                 (0x1UL << RCC_HASH2CFGR_HASH2RST_Pos)                /*!< 0x00000001 */
#define RCC_HASH2CFGR_HASH2RST                     RCC_HASH2CFGR_HASH2RST_Msk                        /*!< HASH2 reset */
#define RCC_HASH2CFGR_HASH2EN_Pos                  (1U)
#define RCC_HASH2CFGR_HASH2EN_Msk                  (0x1UL << RCC_HASH2CFGR_HASH2EN_Pos)                 /*!< 0x00000002 */
#define RCC_HASH2CFGR_HASH2EN                      RCC_HASH2CFGR_HASH2EN_Msk                         /*!< HASH2 clock enable */
#define RCC_HASH2CFGR_HASH2LPEN_Pos                (2U)
#define RCC_HASH2CFGR_HASH2LPEN_Msk                (0x1UL << RCC_HASH2CFGR_HASH2LPEN_Pos)               /*!< 0x00000004 */
#define RCC_HASH2CFGR_HASH2LPEN                    RCC_HASH2CFGR_HASH2LPEN_Msk                       /*!< HASH2 clock enable during CSleep */

/* Bit fields for RCC_CRYP1CFGR register */
#define RCC_CRYP1CFGR_CRYP1RST_Pos                 (0U)
#define RCC_CRYP1CFGR_CRYP1RST_Msk                 (0x1UL << RCC_CRYP1CFGR_CRYP1RST_Pos)                /*!< 0x00000001 */
#define RCC_CRYP1CFGR_CRYP1RST                     RCC_CRYP1CFGR_CRYP1RST_Msk                        /*!< CRYP1 reset */
#define RCC_CRYP1CFGR_CRYP1EN_Pos                  (1U)
#define RCC_CRYP1CFGR_CRYP1EN_Msk                  (0x1UL << RCC_CRYP1CFGR_CRYP1EN_Pos)                 /*!< 0x00000002 */
#define RCC_CRYP1CFGR_CRYP1EN                      RCC_CRYP1CFGR_CRYP1EN_Msk                         /*!< CRYP1 clock enable */
#define RCC_CRYP1CFGR_CRYP1LPEN_Pos                (2U)
#define RCC_CRYP1CFGR_CRYP1LPEN_Msk                (0x1UL << RCC_CRYP1CFGR_CRYP1LPEN_Pos)               /*!< 0x00000004 */
#define RCC_CRYP1CFGR_CRYP1LPEN                    RCC_CRYP1CFGR_CRYP1LPEN_Msk                       /*!< CRYP1 clock enable during CSleep */

/* Bit fields for RCC_CRYP2CFGR register */
#define RCC_CRYP2CFGR_CRYP2RST_Pos                 (0U)
#define RCC_CRYP2CFGR_CRYP2RST_Msk                 (0x1UL << RCC_CRYP2CFGR_CRYP2RST_Pos)                /*!< 0x00000001 */
#define RCC_CRYP2CFGR_CRYP2RST                     RCC_CRYP2CFGR_CRYP2RST_Msk                        /*!< CRYP2 reset */
#define RCC_CRYP2CFGR_CRYP2EN_Pos                  (1U)
#define RCC_CRYP2CFGR_CRYP2EN_Msk                  (0x1UL << RCC_CRYP2CFGR_CRYP2EN_Pos)                 /*!< 0x00000002 */
#define RCC_CRYP2CFGR_CRYP2EN                      RCC_CRYP2CFGR_CRYP2EN_Msk                         /*!< CRYP2 clock enable */
#define RCC_CRYP2CFGR_CRYP2LPEN_Pos                (2U)
#define RCC_CRYP2CFGR_CRYP2LPEN_Msk                (0x1UL << RCC_CRYP2CFGR_CRYP2LPEN_Pos)               /*!< 0x00000004 */
#define RCC_CRYP2CFGR_CRYP2LPEN                    RCC_CRYP2CFGR_CRYP2LPEN_Msk                       /*!< CRYP2 clock enable during CSleep */

