STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp211cxx_cm33.h
/*******************  Bits definition for RISC_RCFGLOCKR4 register *************/
#define RISC_RCFGLOCKR4_RLOCK128_Pos   (0U)
#define RISC_RCFGLOCKR4_RLOCK128_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK128_Pos)     /*!< 0x00000001 */
#define RISC_RCFGLOCKR4_RLOCK128       RISC_RCFGLOCKR4_RLOCK128_Msk
#define RISC_RCFGLOCKR4_RLOCK129_Pos   (1U)
#define RISC_RCFGLOCKR4_RLOCK129_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK129_Pos)     /*!< 0x00000002 */
#define RISC_RCFGLOCKR4_RLOCK129       RISC_RCFGLOCKR4_RLOCK129_Msk
#define RISC_RCFGLOCKR4_RLOCK130_Pos   (2U)
#define RISC_RCFGLOCKR4_RLOCK130_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK130_Pos)     /*!< 0x00000004 */
#define RISC_RCFGLOCKR4_RLOCK130       RISC_RCFGLOCKR4_RLOCK130_Msk
#define RISC_RCFGLOCKR4_RLOCK131_Pos   (3U)
#define RISC_RCFGLOCKR4_RLOCK131_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK131_Pos)     /*!< 0x00000008 */
#define RISC_RCFGLOCKR4_RLOCK131       RISC_RCFGLOCKR4_RLOCK131_Msk
#define RISC_RCFGLOCKR4_RLOCK132_Pos   (4U)
#define RISC_RCFGLOCKR4_RLOCK132_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK132_Pos)     /*!< 0x00000010 */
#define RISC_RCFGLOCKR4_RLOCK132       RISC_RCFGLOCKR4_RLOCK132_Msk
#define RISC_RCFGLOCKR4_RLOCK133_Pos   (5U)
#define RISC_RCFGLOCKR4_RLOCK133_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK133_Pos)     /*!< 0x00000020 */
#define RISC_RCFGLOCKR4_RLOCK133       RISC_RCFGLOCKR4_RLOCK133_Msk
#define RISC_RCFGLOCKR4_RLOCK134_Pos   (6U)
#define RISC_RCFGLOCKR4_RLOCK134_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK134_Pos)     /*!< 0x00000040 */
#define RISC_RCFGLOCKR4_RLOCK134       RISC_RCFGLOCKR4_RLOCK134_Msk
#define RISC_RCFGLOCKR4_RLOCK135_Pos   (7U)
#define RISC_RCFGLOCKR4_RLOCK135_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK135_Pos)     /*!< 0x00000080 */
#define RISC_RCFGLOCKR4_RLOCK135      RISC_RCFGLOCKR4_RLOCK135_Msk
#define RISC_RCFGLOCKR4_RLOCK136_Pos   (8U)
#define RISC_RCFGLOCKR4_RLOCK136_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK136_Pos)     /*!< 0x00000100 */
#define RISC_RCFGLOCKR4_RLOCK136       RISC_RCFGLOCKR4_RLOCK136_Msk
#define RISC_RCFGLOCKR4_RLOCK137_Pos   (9U)
#define RISC_RCFGLOCKR4_RLOCK137_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK137_Pos)     /*!< 0x00000200 */
#define RISC_RCFGLOCKR4_RLOCK137       RISC_RCFGLOCKR4_RLOCK137_Msk
#define RISC_RCFGLOCKR4_RLOCK138_Pos   (10U)
#define RISC_RCFGLOCKR4_RLOCK138_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK138_Pos)     /*!< 0x00000400 */
#define RISC_RCFGLOCKR4_RLOCK138       RISC_RCFGLOCKR4_RLOCK138_Msk
#define RISC_RCFGLOCKR4_RLOCK139_Pos   (11U)
#define RISC_RCFGLOCKR4_RLOCK139_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK139_Pos)     /*!< 0x00000800 */
#define RISC_RCFGLOCKR4_RLOCK139       RISC_RCFGLOCKR4_RLOCK139_Msk
#define RISC_RCFGLOCKR4_RLOCK140_Pos   (12U)
#define RISC_RCFGLOCKR4_RLOCK140_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK140_Pos)     /*!< 0x00001000 */
#define RISC_RCFGLOCKR4_RLOCK140       RISC_RCFGLOCKR4_RLOCK140_Msk
#define RISC_RCFGLOCKR4_RLOCK141_Pos   (13U)
#define RISC_RCFGLOCKR4_RLOCK141_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK141_Pos)     /*!< 0x00002000 */
#define RISC_RCFGLOCKR4_RLOCK141       RISC_RCFGLOCKR4_RLOCK141_Msk
#define RISC_RCFGLOCKR4_RLOCK142_Pos   (14U)
#define RISC_RCFGLOCKR4_RLOCK142_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK142_Pos)     /*!< 0x00004000 */
#define RISC_RCFGLOCKR4_RLOCK142       RISC_RCFGLOCKR4_RLOCK142_Msk
#define RISC_RCFGLOCKR4_RLOCK143_Pos   (15U)
#define RISC_RCFGLOCKR4_RLOCK143_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK143_Pos)     /*!< 0x00008000 */
#define RISC_RCFGLOCKR4_RLOCK143       RISC_RCFGLOCKR4_RLOCK143_Msk
#define RISC_RCFGLOCKR4_RLOCK144_Pos   (16U)
#define RISC_RCFGLOCKR4_RLOCK144_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK144_Pos)     /*!< 0x00010000 */
#define RISC_RCFGLOCKR4_RLOCK144       RISC_RCFGLOCKR4_RLOCK144_Msk
#define RISC_RCFGLOCKR4_RLOCK145_Pos   (17U)
#define RISC_RCFGLOCKR4_RLOCK145_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK145_Pos)     /*!< 0x00020000 */
#define RISC_RCFGLOCKR4_RLOCK145       RISC_RCFGLOCKR4_RLOCK145_Msk
#define RISC_RCFGLOCKR4_RLOCK146_Pos   (18U)
#define RISC_RCFGLOCKR4_RLOCK146_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK146_Pos)     /*!< 0x00040000 */
#define RISC_RCFGLOCKR4_RLOCK146       RISC_RCFGLOCKR4_RLOCK146_Msk
#define RISC_RCFGLOCKR4_RLOCK147_Pos   (19U)
#define RISC_RCFGLOCKR4_RLOCK147_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK147_Pos)     /*!< 0x00080000 */
#define RISC_RCFGLOCKR4_RLOCK147       RISC_RCFGLOCKR4_RLOCK147_Msk
#define RISC_RCFGLOCKR4_RLOCK148_Pos   (20U)
#define RISC_RCFGLOCKR4_RLOCK148_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK148_Pos)     /*!< 0x00100000 */
#define RISC_RCFGLOCKR4_RLOCK148       RISC_RCFGLOCKR4_RLOCK148_Msk
#define RISC_RCFGLOCKR4_RLOCK149_Pos   (21U)
#define RISC_RCFGLOCKR4_RLOCK149_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK149_Pos)     /*!< 0x00200000 */
#define RISC_RCFGLOCKR4_RLOCK149       RISC_RCFGLOCKR4_RLOCK149_Msk
#define RISC_RCFGLOCKR4_RLOCK150_Pos   (22U)
#define RISC_RCFGLOCKR4_RLOCK150_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK150_Pos)     /*!< 0x00400000 */
#define RISC_RCFGLOCKR4_RLOCK150       RISC_RCFGLOCKR4_RLOCK150_Msk
#define RISC_RCFGLOCKR4_RLOCK151_Pos   (23U)
#define RISC_RCFGLOCKR4_RLOCK151_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK151_Pos)     /*!< 0x00800000 */
#define RISC_RCFGLOCKR4_RLOCK151       RISC_RCFGLOCKR4_RLOCK151_Msk
#define RISC_RCFGLOCKR4_RLOCK152_Pos   (24U)
#define RISC_RCFGLOCKR4_RLOCK152_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK152_Pos)     /*!< 0x01000000 */
#define RISC_RCFGLOCKR4_RLOCK152       RISC_RCFGLOCKR4_RLOCK152_Msk
#define RISC_RCFGLOCKR4_RLOCK153_Pos   (25U)
#define RISC_RCFGLOCKR4_RLOCK153_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK153_Pos)     /*!< 0x02000000 */
#define RISC_RCFGLOCKR4_RLOCK153       RISC_RCFGLOCKR4_RLOCK153_Msk
#define RISC_RCFGLOCKR4_RLOCK154_Pos   (26U)
#define RISC_RCFGLOCKR4_RLOCK154_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK154_Pos)     /*!< 0x04000000 */
#define RISC_RCFGLOCKR4_RLOCK154       RISC_RCFGLOCKR4_RLOCK154_Msk
#define RISC_RCFGLOCKR4_RLOCK155_Pos   (27U)
#define RISC_RCFGLOCKR4_RLOCK155_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK155_Pos)     /*!< 0x08000000 */
#define RISC_RCFGLOCKR4_RLOCK155       RISC_RCFGLOCKR4_RLOCK155_Msk
#define RISC_RCFGLOCKR4_RLOCK156_Pos   (28U)
#define RISC_RCFGLOCKR4_RLOCK156_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK156_Pos)     /*!< 0x10000000 */
#define RISC_RCFGLOCKR4_RLOCK156       RISC_RCFGLOCKR4_RLOCK156_Msk
#define RISC_RCFGLOCKR4_RLOCK157_Pos   (29U)
#define RISC_RCFGLOCKR4_RLOCK157_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK157_Pos)     /*!< 0x20000000 */
#define RISC_RCFGLOCKR4_RLOCK157       RISC_RCFGLOCKR4_RLOCK157_Msk
#define RISC_RCFGLOCKR4_RLOCK158_Pos   (30U)
#define RISC_RCFGLOCKR4_RLOCK158_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK158_Pos)     /*!< 0x40000000 */
#define RISC_RCFGLOCKR4_RLOCK158       RISC_RCFGLOCKR4_RLOCK158_Msk
#define RISC_RCFGLOCKR4_RLOCK159_Pos   (31U)
#define RISC_RCFGLOCKR4_RLOCK159_Msk   (0x1UL << RISC_RCFGLOCKR4_RLOCK159_Pos)     /*!< 0x80000000 */
#define RISC_RCFGLOCKR4_RLOCK159       RISC_RCFGLOCKR4_RLOCK159_Msk

/*******************  Bits definition for RISC_RCFGLOCKR5 register *************/
#define RISC_RCFGLOCKR5_RLOCK160_Pos   (0U)
#define RISC_RCFGLOCKR5_RLOCK160_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK160_Pos)     /*!< 0x00000001 */
#define RISC_RCFGLOCKR5_RLOCK160       RISC_RCFGLOCKR5_RLOCK160_Msk
#define RISC_RCFGLOCKR5_RLOCK161_Pos   (1U)
#define RISC_RCFGLOCKR5_RLOCK161_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK161_Pos)     /*!< 0x00000002 */
#define RISC_RCFGLOCKR5_RLOCK161       RISC_RCFGLOCKR5_RLOCK161_Msk
#define RISC_RCFGLOCKR5_RLOCK162_Pos   (2U)
#define RISC_RCFGLOCKR5_RLOCK162_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK162_Pos)     /*!< 0x00000004 */
#define RISC_RCFGLOCKR5_RLOCK162       RISC_RCFGLOCKR5_RLOCK162_Msk
#define RISC_RCFGLOCKR5_RLOCK163_Pos   (3U)
#define RISC_RCFGLOCKR5_RLOCK163_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK163_Pos)     /*!< 0x00000008 */
#define RISC_RCFGLOCKR5_RLOCK163       RISC_RCFGLOCKR5_RLOCK163_Msk
#define RISC_RCFGLOCKR5_RLOCK164_Pos   (4U)
#define RISC_RCFGLOCKR5_RLOCK164_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK164_Pos)     /*!< 0x00000010 */
#define RISC_RCFGLOCKR5_RLOCK164       RISC_RCFGLOCKR5_RLOCK164_Msk
#define RISC_RCFGLOCKR5_RLOCK165_Pos   (5U)
#define RISC_RCFGLOCKR5_RLOCK165_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK165_Pos)     /*!< 0x00000020 */
#define RISC_RCFGLOCKR5_RLOCK165       RISC_RCFGLOCKR5_RLOCK165_Msk
#define RISC_RCFGLOCKR5_RLOCK166_Pos   (6U)
#define RISC_RCFGLOCKR5_RLOCK166_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK166_Pos)     /*!< 0x00000040 */
#define RISC_RCFGLOCKR5_RLOCK166       RISC_RCFGLOCKR5_RLOCK166_Msk
#define RISC_RCFGLOCKR5_RLOCK167_Pos   (7U)
#define RISC_RCFGLOCKR5_RLOCK167_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK167_Pos)     /*!< 0x00000080 */
#define RISC_RCFGLOCKR5_RLOCK167       RISC_RCFGLOCKR5_RLOCK167_Msk
#define RISC_RCFGLOCKR5_RLOCK168_Pos   (8U)
#define RISC_RCFGLOCKR5_RLOCK168_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK168_Pos)     /*!< 0x00000100 */
#define RISC_RCFGLOCKR5_RLOCK168        RISC_RCFGLOCKR5_RLOCK168_Msk
#define RISC_RCFGLOCKR5_RLOCK169_Pos   (9U)
#define RISC_RCFGLOCKR5_RLOCK169_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK169_Pos)     /*!< 0x00000200 */
#define RISC_RCFGLOCKR5_RLOCK169       RISC_RCFGLOCKR5_RLOCK169_Msk
#define RISC_RCFGLOCKR5_RLOCK170_Pos   (10U)
#define RISC_RCFGLOCKR5_RLOCK170_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK170_Pos)     /*!< 0x00000400 */
#define RISC_RCFGLOCKR5_RLOCK170       RISC_RCFGLOCKR5_RLOCK170_Msk
#define RISC_RCFGLOCKR5_RLOCK171_Pos   (11U)
#define RISC_RCFGLOCKR5_RLOCK171_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK171_Pos)     /*!< 0x00000800 */
#define RISC_RCFGLOCKR5_RLOCK171       RISC_RCFGLOCKR5_RLOCK171_Msk
#define RISC_RCFGLOCKR5_RLOCK172_Pos   (12U)
#define RISC_RCFGLOCKR5_RLOCK172_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK172_Pos)     /*!< 0x00001000 */
#define RISC_RCFGLOCKR5_RLOCK172       RISC_RCFGLOCKR5_RLOCK172_Msk
#define RISC_RCFGLOCKR5_RLOCK173_Pos   (13U)
#define RISC_RCFGLOCKR5_RLOCK173_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK173_Pos)     /*!< 0x00002000 */
#define RISC_RCFGLOCKR5_RLOCK173       RISC_RCFGLOCKR5_RLOCK173_Msk
#define RISC_RCFGLOCKR5_RLOCK174_Pos   (14U)
#define RISC_RCFGLOCKR5_RLOCK174_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK174_Pos)     /*!< 0x00004000 */
#define RISC_RCFGLOCKR5_RLOCK174       RISC_RCFGLOCKR5_RLOCK174_Msk
#define RISC_RCFGLOCKR5_RLOCK175_Pos   (15U)
#define RISC_RCFGLOCKR5_RLOCK175_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK175_Pos)     /*!< 0x00008000 */
#define RISC_RCFGLOCKR5_RLOCK175       RISC_RCFGLOCKR5_RLOCK175_Msk
#define RISC_RCFGLOCKR5_RLOCK176_Pos   (16U)
#define RISC_RCFGLOCKR5_RLOCK176_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK176_Pos)     /*!< 0x00010000 */
#define RISC_RCFGLOCKR5_RLOCK176       RISC_RCFGLOCKR5_RLOCK176_Msk
#define RISC_RCFGLOCKR5_RLOCK177_Pos   (17U)
#define RISC_RCFGLOCKR5_RLOCK177_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK177_Pos)     /*!< 0x00020000 */
#define RISC_RCFGLOCKR5_RLOCK177       RISC_RCFGLOCKR5_RLOCK177_Msk
#define RISC_RCFGLOCKR5_RLOCK178_Pos   (18U)
#define RISC_RCFGLOCKR5_RLOCK178_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK178_Pos)     /*!< 0x00040000 */
#define RISC_RCFGLOCKR5_RLOCK178       RISC_RCFGLOCKR5_RLOCK178_Msk
#define RISC_RCFGLOCKR5_RLOCK179_Pos   (19U)
#define RISC_RCFGLOCKR5_RLOCK179_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK179_Pos)     /*!< 0x00080000 */
#define RISC_RCFGLOCKR5_RLOCK179       RISC_RCFGLOCKR5_RLOCK179_Msk
#define RISC_RCFGLOCKR5_RLOCK180_Pos   (20U)
#define RISC_RCFGLOCKR5_RLOCK180_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK180_Pos)     /*!< 0x00100000 */
#define RISC_RCFGLOCKR5_RLOCK180       RISC_RCFGLOCKR5_RLOCK180_Msk
#define RISC_RCFGLOCKR5_RLOCK181_Pos   (21U)
#define RISC_RCFGLOCKR5_RLOCK181_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK181_Pos)     /*!< 0x00200000 */
#define RISC_RCFGLOCKR5_RLOCK181       RISC_RCFGLOCKR5_RLOCK181_Msk
#define RISC_RCFGLOCKR5_RLOCK182_Pos   (22U)
#define RISC_RCFGLOCKR5_RLOCK182_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK182_Pos)     /*!< 0x00400000 */
#define RISC_RCFGLOCKR5_RLOCK182       RISC_RCFGLOCKR5_RLOCK182_Msk
#define RISC_RCFGLOCKR5_RLOCK183_Pos   (23U)
#define RISC_RCFGLOCKR5_RLOCK183_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK183_Pos)     /*!< 0x00800000 */
#define RISC_RCFGLOCKR5_RLOCK183       RISC_RCFGLOCKR5_RLOCK183_Msk
#define RISC_RCFGLOCKR5_RLOCK184_Pos   (24U)
#define RISC_RCFGLOCKR5_RLOCK184_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK184_Pos)     /*!< 0x01000000 */
#define RISC_RCFGLOCKR5_RLOCK184       RISC_RCFGLOCKR5_RLOCK184_Msk
#define RISC_RCFGLOCKR5_RLOCK185_Pos   (25U)
#define RISC_RCFGLOCKR5_RLOCK185_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK185_Pos)     /*!< 0x02000000 */
#define RISC_RCFGLOCKR5_RLOCK185       RISC_RCFGLOCKR5_RLOCK185_Msk
#define RISC_RCFGLOCKR5_RLOCK186_Pos   (26U)
#define RISC_RCFGLOCKR5_RLOCK186_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK186_Pos)     /*!< 0x04000000 */
#define RISC_RCFGLOCKR5_RLOCK186       RISC_RCFGLOCKR5_RLOCK186_Msk
#define RISC_RCFGLOCKR5_RLOCK187_Pos   (27U)
#define RISC_RCFGLOCKR5_RLOCK187_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK187_Pos)     /*!< 0x08000000 */
#define RISC_RCFGLOCKR5_RLOCK187       RISC_RCFGLOCKR5_RLOCK187_Msk
#define RISC_RCFGLOCKR5_RLOCK188_Pos   (28U)
#define RISC_RCFGLOCKR5_RLOCK188_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK188_Pos)     /*!< 0x10000000 */
#define RISC_RCFGLOCKR5_RLOCK188       RISC_RCFGLOCKR5_RLOCK188_Msk
#define RISC_RCFGLOCKR5_RLOCK189_Pos   (29U)
#define RISC_RCFGLOCKR5_RLOCK189_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK189_Pos)     /*!< 0x20000000 */
#define RISC_RCFGLOCKR5_RLOCK189       RISC_RCFGLOCKR5_RLOCK189_Msk
#define RISC_RCFGLOCKR5_RLOCK190_Pos   (30U)
#define RISC_RCFGLOCKR5_RLOCK190_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK190_Pos)     /*!< 0x40000000 */
#define RISC_RCFGLOCKR5_RLOCK190       RISC_RCFGLOCKR5_RLOCK190_Msk
#define RISC_RCFGLOCKR5_RLOCK191_Pos   (31U)
#define RISC_RCFGLOCKR5_RLOCK191_Msk   (0x1UL << RISC_RCFGLOCKR5_RLOCK191_Pos)     /*!< 0x80000000 */
#define RISC_RCFGLOCKR5_RLOCK191       RISC_RCFGLOCKR5_RLOCK191_Msk

/*******************  Bits definition for RISC_PERx_CIDCFGR register **********/
#define RISC_PERCIDCFGR_CFEN_Pos      (0U)
#define RISC_PERCIDCFGR_CFEN_Msk      (0x1UL << RISC_PERCIDCFGR_CFEN_Pos)        /*!< 0x00000001 */
#define RISC_PERCIDCFGR_CFEN          RISC_PERCIDCFGR_CFEN_Msk

