STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp211cxx_cm33.h
/********************  Bit definition for TIM_AF1 register  *******************/
#define TIM1_AF1_BKINE_Pos        (0U)
#define TIM1_AF1_BKINE_Msk        (0x1UL << TIM1_AF1_BKINE_Pos)                /*!< 0x00000001 */
#define TIM1_AF1_BKINE            TIM1_AF1_BKINE_Msk                           /*!< BRK BKIN input enable */
#define TIM1_AF1_BKINP_Pos        (9U)
#define TIM1_AF1_BKINP_Msk        (0x1UL << TIM1_AF1_BKINP_Pos)                /*!< 0x00000200 */
#define TIM1_AF1_BKINP            TIM1_AF1_BKINP_Msk                           /*!< BRK BKIN input polarity */
#define TIM1_AF1_ETRSEL_Pos       (14U)
#define TIM1_AF1_ETRSEL_Msk       (0xFUL << TIM1_AF1_ETRSEL_Pos)               /*!< 0x0003C000 */
#define TIM1_AF1_ETRSEL           TIM1_AF1_ETRSEL_Msk                          /*!< ETRSEL[3:0] bits (TIM ETR source selection) */
#define TIM1_AF1_ETRSEL_0         (0x1UL << TIM1_AF1_ETRSEL_Pos)               /*!< 0x00004000 */
#define TIM1_AF1_ETRSEL_1         (0x2UL << TIM1_AF1_ETRSEL_Pos)               /*!< 0x00008000 */
#define TIM1_AF1_ETRSEL_2         (0x4UL << TIM1_AF1_ETRSEL_Pos)               /*!< 0x00010000 */
#define TIM1_AF1_ETRSEL_3         (0x8UL << TIM1_AF1_ETRSEL_Pos)               /*!< 0x00020000 */

/*------------------------------  TIM1 specific  -----------------------------*/
#define TIM1_AF1_BKMDF1BK0E_Pos   (8U)
#define TIM1_AF1_BKMDF1BK0E_Msk   (0x1UL << TIM1_AF1_BKMDF1BK0E_Pos)           /*!< 0x00000100 */
#define TIM1_AF1_BKMDF1BK0E       TIM1_AF1_BKMDF1BK0E_Msk                      /*!< BRK mdf1_break[0] enable*/

/*------------------------------  TIM8 specific  -----------------------------*/
#define TIM8_AF1_BKMDF1BK2E_Pos   (8U)
#define TIM8_AF1_BKMDF1BK2E_Msk   (0x1UL << TIM8_AF1_BKMDF1BK2E_Pos)           /*!< 0x00000100 */
#define TIM8_AF1_BKMDF1BK2E       TIM8_AF1_BKMDF1BK2E_Msk                      /*!< BRK mdf1_break[2] enable*/

/*-----------------------------  TIM15 specific  -----------------------------*/
#define TIM15_AF1_BKMDF1BK0E_Pos  (8U)
#define TIM15_AF1_BKMDF1BK0E_Msk  (0x1UL << TIM15_AF1_BKMDF1BK0E_Pos)          /*!< 0x00000100 */
#define TIM15_AF1_BKMDF1BK0E      TIM15_AF1_BKMDF1BK0E_Msk                     /*!< BRK mdf1_break[0] enable*/

/*-----------------------------  TIM16 specific  -----------------------------*/
#define TIM16_AF1_BKMDF1BK1E_Pos  (8U)
#define TIM16_AF1_BKMDF1BK1E_Msk  (0x1UL << TIM16_AF1_BKMDF1BK1E_Pos)          /*!< 0x00000100 */
#define TIM16_AF1_BKMDF1BK1E      TIM16_AF1_BKMDF1BK1E_Msk                     /*!< BRK mdf1_break[1] enable*/

/*-----------------------------  TIM17 specific  -----------------------------*/
#define TIM17_AF1_BKMDF1BK2E_Pos  (8U)
#define TIM17_AF1_BKMDF1BK2E_Msk  (0x1UL << TIM17_AF1_BKMDF1BK2E_Pos)          /*!< 0x00000100 */
#define TIM17_AF1_BKMDF1BK2E      TIM16_AF1_BKMDF1BK2E_Msk                     /*!< BRK mdf1_break[2] enable*/

/*-----------------------------  TIM20 specific  -----------------------------*/
#define TIM20_AF1_BKMDF1BK2E_Pos  (8U)
#define TIM20_AF1_BKMDF1BK2E_Msk  (0x1UL << TIM20_AF1_BKMDF1BK0E_Pos)          /*!< 0x00000100 */
#define TIM20_AF1_BKMDF1BK2E      TIM20_AF1_BKMDF1BK0E_Msk                     /*!< BRK mdf1_break[0] enable*/

/******************  Bit definition for TIM_AF2 register  *********************/
#define TIM1_AF2_BK2INE_Pos       (0U)
#define TIM1_AF2_BK2INE_Msk       (0x1UL << TIM1_AF2_BK2INE_Pos)               /*!< 0x00000001 */
#define TIM1_AF2_BK2INE           TIM1_AF2_BK2INE_Msk                          /*!< BRK2 BKIN input enable */
#define TIM1_AF2_BK2INP_Pos       (9U)
#define TIM1_AF2_BK2INP_Msk       (0x1UL << TIM1_AF2_BK2INP_Pos)               /*!< 0x00000200 */
#define TIM1_AF2_BK2INP           TIM1_AF2_BK2INP_Msk                          /*!< BRK2 BKIN input polarity */
#define TIM1_AF2_OCRSEL_Pos       (16U)
#define TIM1_AF2_OCRSEL_Msk       (0x7UL << TIM1_AF2_OCRSEL_Pos)               /*!< 0x00070000 */
#define TIM1_AF2_OCRSEL           TIM1_AF2_OCRSEL_Msk                          /*!< ocref_clr source selection */

/*------------------------------  TIM1 specific  -----------------------------*/
#define TIM1_AF2_BK2MDF1BK1E_Pos  (8U)
#define TIM1_AF2_BK2MDF1BK1E_Msk  (0x1UL << TIM1_AF2_BK2MDF1BK1E_Pos)          /*!< 0x00000100 */
#define TIM1_AF2_BK2MDF1BK1E      TIM1_AF2_BK2MDF1BK1E_Msk                     /*!< BRK2 mdf1_break[1] enable */

/*-(----------------------------  TIM8 specific  -----------------------------*/
#define TIM8_AF2_BK2MDF1BK3E_Pos  (8U)
#define TIM8_AF2_BK2MDF1BK3E_Msk  (0x1UL << TIM8_AF2_BK2MDF1BK3E_Pos)          /*!< 0x00000100 */
#define TIM8_AF2_BK2MDF1BK3E      TIM8_AF2_BK2MDF1BK3E_Msk                     /*!< BRK2 mdf1_break[3] enable */

/*-----------------------------  TIM20 specific  -----------------------------*/
#define TIM20_AF2_BK2MDF1BK1E_Pos (8U)
#define TIM20_AF2_BK2MDF1BK1E_Msk (0x1UL << TIM20_AF2_BK2MDF1BK1E_Pos)         /*!< 0x00000100 */
#define TIM20_AF2_BK2MDF1BK1E     TIM20_AF2_BK2MDF1BK1E_Msk                    /*!< BRK2 mdf1_break[1] enable */

/*******************  Bit definition for TIM_DCR register  ********************/
#define TIM_DCR_DBA_Pos           (0U)
#define TIM_DCR_DBA_Msk           (0x1FUL << TIM_DCR_DBA_Pos)                  /*!< 0x0000001F */
#define TIM_DCR_DBA               TIM_DCR_DBA_Msk                              /*!< DBA[4:0] bits (DMA Base Address) */
#define TIM_DCR_DBA_0             (0x01UL << TIM_DCR_DBA_Pos)                  /*!< 0x00000001 */
#define TIM_DCR_DBA_1             (0x02UL << TIM_DCR_DBA_Pos)                  /*!< 0x00000002 */
#define TIM_DCR_DBA_2             (0x04UL << TIM_DCR_DBA_Pos)                  /*!< 0x00000004 */
#define TIM_DCR_DBA_3             (0x08UL << TIM_DCR_DBA_Pos)                  /*!< 0x00000008 */
#define TIM_DCR_DBA_4             (0x10UL << TIM_DCR_DBA_Pos)                  /*!< 0x00000010 */
#define TIM_DCR_DBL_Pos           (8U)
#define TIM_DCR_DBL_Msk           (0x1FUL << TIM_DCR_DBL_Pos)                  /*!< 0x00001F00 */
#define TIM_DCR_DBL               TIM_DCR_DBL_Msk                              /*!< DBL[4:0] bits (DMA Burst Length) */
#define TIM_DCR_DBL_0             (0x01UL << TIM_DCR_DBL_Pos)                  /*!< 0x00000100 */
#define TIM_DCR_DBL_1             (0x02UL << TIM_DCR_DBL_Pos)                  /*!< 0x00000200 */
#define TIM_DCR_DBL_2             (0x04UL << TIM_DCR_DBL_Pos)                  /*!< 0x00000400 */
#define TIM_DCR_DBL_3             (0x08UL << TIM_DCR_DBL_Pos)                  /*!< 0x00000800 */
#define TIM_DCR_DBL_4             (0x10UL << TIM_DCR_DBL_Pos)                  /*!< 0x00001000 */
#define TIM_DCR_DBSS_Pos          (16U)
#define TIM_DCR_DBSS_Msk          (0xFUL << TIM_DCR_DBSS_Pos)                  /*!< 0x00000F00 */
#define TIM_DCR_DBSS               TIM_DCR_DBSS_Msk                            /*!< DBSS[19:16] bits (DMA Burst Source Selection) */
#define TIM_DCR_DBSS_0            (0x01UL << TIM_DCR_DBSS_Pos)                 /*!< 0x00000100 */
#define TIM_DCR_DBSS_1            (0x02UL << TIM_DCR_DBSS_Pos)                 /*!< 0x00000200 */
#define TIM_DCR_DBSS_2            (0x04UL << TIM_DCR_DBSS_Pos)                 /*!< 0x00000400 */
#define TIM_DCR_DBSS_3            (0x08UL << TIM_DCR_DBSS_Pos)                 /*!< 0x00000800 */

/*******************  Bit definition for TIM_DMAR register  *******************/
#define TIM_DMAR_DMAB_Pos         (0U)
#define TIM_DMAR_DMAB_Msk         (0xFFFFFFFFUL << TIM_DMAR_DMAB_Pos)          /*!< 0xFFFFFFFF */
#define TIM_DMAR_DMAB             TIM_DMAR_DMAB_Msk                            /*!< DMA register for burst accesses */

/******************  Bits definition for TIM_HWCFGR2 register  ****************/
#define TIM_HWCFGR2_PSC_LINEAR_Pos     (0U)
#define TIM_HWCFGR2_PSC_LINEAR_Msk     (0xFUL << TIM_HWCFGR2_PSC_LINEAR_Pos)   /*!< 0x0000000F */
#define TIM_HWCFGR2_PSC_LINEAR         TIM_HWCFGR2_PSC_LINEAR_Msk              /*!< Option register number */
#define TIM_HWCFGR2_PSC_WIDTH16_Pos    (4U)
#define TIM_HWCFGR2_PSC_WIDTH16_Msk    (0xFUL << TIM_HWCFGR2_PSC_WIDTH16_Pos)  /*!< 0x000000F0 */
#define TIM_HWCFGR2_PSC_WIDTH16        TIM_HWCFGR2_PSC_WIDTH16_Msk             /*!< Prescaler width */
#define TIM_HWCFGR2_CNT_WIDTH_Pos      (8U)
#define TIM_HWCFGR2_CNT_WIDTH_Msk      (0xFFUL << TIM_HWCFGR2_CNT_WIDTH_Pos)   /*!< 0x0000FF00 */
#define TIM_HWCFGR2_CNT_WIDTH          TIM_HWCFGR2_CNT_WIDTH_Msk               /*!< Counter width */
#define TIM_HWCFGR2_OPTIONREG_OUT_Pos  (16U)
#define TIM_HWCFGR2_OPTIONREG_OUT_Msk  (0xFFUL << TIM_HWCFGR2_OPTIONREG_OUT_Pos) /*!< 0x00FF0000 */
#define TIM_HWCFGR2_OPTIONREG_OUT      TIM_HWCFGR2_OPTIONREG_OUT_Msk           /*!< Option register number */

/*****************  Bits definition for TIM_HWCFGR1 register  *****************/
#define TIM_HWCFGR1_NB_OF_CC_Pos    (0U)
#define TIM_HWCFGR1_NB_OF_CC_Msk    (0xFUL << TIM_HWCFGR1_NB_OF_CC_Pos)        /*!< 0x0000000F */
#define TIM_HWCFGR1_NB_OF_CC        TIM_HWCFGR1_NB_OF_CC_Msk                   /*!< Number of capture / compare channel */
#define TIM_HWCFGR1_NB_OF_DT_Pos    (4U)
#define TIM_HWCFGR1_NB_OF_DT_Msk    (0xFUL << TIM_HWCFGR1_NB_OF_DT_Pos)        /*!< 0x000000F0 */
#define TIM_HWCFGR1_NB_OF_DT        TIM_HWCFGR1_NB_OF_DT_Msk                   /*!< Number of complementary outputs and dead-time generators */
#define TIM_HWCFGR1_NB_OF_SM_Pos    (8U)
#define TIM_HWCFGR1_NB_OF_SM_Msk    (0xFUL << TIM_HWCFGR1_NB_OF_SM_Pos)        /*!< 0x00000F00 */
#define TIM_HWCFGR1_NB_OF_SM        TIM_HWCFGR1_NB_OF_SM_Msk                   /*!< Number of synchronization module */
#define TIM_HWCFGR1_RCR_IMPL_Pos    (12U)
#define TIM_HWCFGR1_RCR_IMPL_Msk    (0xFUL << TIM_HWCFGR1_RCR_IMPL_Pos)        /*!< 0x0000F000 */
#define TIM_HWCFGR1_RCR_IMPL        TIM_HWCFGR1_RCR_IMPL_Msk                   /*!< Repetition counter implementation */
#define TIM_HWCFGR1_ETR_IMPL_Pos    (16U)
#define TIM_HWCFGR1_ETR_IMPL_Msk    (0xFUL << TIM_HWCFGR1_ETR_IMPL_Pos)        /*!< 0x000F0000 */
#define TIM_HWCFGR1_ETR_IMPL        TIM_HWCFGR1_ETR_IMPL_Msk                   /*!< External trigger implementation */
#define TIM_HWCFGR1_BK_IMPL_Pos     (20U)
#define TIM_HWCFGR1_BK_IMPL_Msk     (0xFUL << TIM_HWCFGR1_BK_IMPL_Pos)         /*!< 0x00F00000 */
#define TIM_HWCFGR1_BK_IMPL         TIM_HWCFGR1_BK_IMPL_Msk                    /*!< Break circuit implementation */
#define TIM_HWCFGR1_DMA_IMPL_Pos    (24U)
#define TIM_HWCFGR1_DMA_IMPL_Msk    (0xFUL << TIM_HWCFGR1_DMA_IMPL_Pos)        /*!< 0x0F000000 */
#define TIM_HWCFGR1_DMA_IMPL        TIM_HWCFGR1_DMA_IMPL_Msk                   /*!< DMA features implementation */
#define TIM_HWCFGR1_CNT_DIR_Pos     (28U)
#define TIM_HWCFGR1_CNT_DIR_Msk     (0xFUL << TIM_HWCFGR1_CNT_DIR_Pos)         /*!< 0xF0000000 */
#define TIM_HWCFGR1_CNT_DIR         TIM_HWCFGR1_CNT_DIR_Msk                    /*!< Counter direction */

/*******************  Bits definition for TIM_VERR register  ******************/
#define TIM_VERR_MINREV_Pos            (0U)
#define TIM_VERR_MINREV_Msk            (0x4UL << TIM_VERR_MINREV_Pos)          /*!< 0x0000000F */
#define TIM_VERR_MINREV                TIM_VERR_MINREV_Msk                     /*!< TIM Minor version */
#define TIM_VERR_MAJREV_Pos            (4U)
#define TIM_VERR_MAJREV_Msk            (0x4UL << TAMPC_VERR_MAJREV_Pos)        /*!< 0x000000F0 */
#define TIM_VERR_MAJREV                TIM_VERR_MAJREV_Msk                     /*!< TIM Major version */

/******************  Bits definition for TIM_IPIDR register  ******************/
#define TIM_IPIDR_ID_Pos               (0U)
#define TIM_IPIDR_ID_Msk               (0xFFFFFFFFUL << TIM_IPIDR_ID_Pos)      /*!< 0xFFFFFFFF */
#define TIM_IPIDR_ID                   TIM_IPIDR_ID_Msk                        /*!< TIM ID */

/******************  Bits definition for TAMP_SIDR register  ******************/
#define TIM_SIDR_SID_Pos               (0U)
#define TIM_SIDR_SID_Msk               (0xFFFFFFFFUL << TIM_SIDR_SID_Pos)      /*!< 0xFFFFFFFF */
#define TIM_SIDR_SID                   TIM_SIDR_SID_Msk                        /*!< TIM Size ID */

/******************************************************************************/
/*                                                                            */
/*      Universal Synchronous Asynchronous Receiver Transmitter (USART)       */
/*                                                                            */
/******************************************************************************/
/* c7amba_sci3_v3.0 */
/******************  Bit definition for USART_CR1 register  *******************/
/******************  Bit definition for USART_CR1 register  *******************/
#define USART_CR1_UE_Pos               (0U)
#define USART_CR1_UE_Msk               (0x1UL << USART_CR1_UE_Pos)  /*!< 0x00000001 */
#define USART_CR1_UE                   USART_CR1_UE_Msk            /*!< USART enable */
#define USART_CR1_UESM_Pos             (1U)
#define USART_CR1_UESM_Msk             (0x1UL << USART_CR1_UESM_Pos)/*!< 0x00000002 */
#define USART_CR1_UESM                 USART_CR1_UESM_Msk          /*!< USART enable in low-power mode  */
#define USART_CR1_RE_Pos               (2U)
#define USART_CR1_RE_Msk               (0x1UL << USART_CR1_RE_Pos)  /*!< 0x00000004 */
#define USART_CR1_RE                   USART_CR1_RE_Msk            /*!< Receiver enable */
#define USART_CR1_TE_Pos               (3U)
#define USART_CR1_TE_Msk               (0x1UL << USART_CR1_TE_Pos)  /*!< 0x00000008 */
#define USART_CR1_TE                   USART_CR1_TE_Msk            /*!< Transmitter enable */
#define USART_CR1_IDLEIE_Pos           (4U)
#define USART_CR1_IDLEIE_Msk           (0x1UL << USART_CR1_IDLEIE_Pos)  /*!< 0x00000010 */
#define USART_CR1_IDLEIE               USART_CR1_IDLEIE_Msk        /*!< IDLE interrupt enable */
#define USART_CR1_RXFNEIE_Pos          (5U)
#define USART_CR1_RXFNEIE_Msk          (0x1UL << USART_CR1_RXFNEIE_Pos)   /*!< 0x00000020 */
#define USART_CR1_RXFNEIE              USART_CR1_RXFNEIE_Msk       /*!< RXFIFO not empty interrupt enable */
#define USART_CR1_RXNEIE_RXFNEIE_Pos   USART_CR1_RXFNEIE_Pos
#define USART_CR1_RXNEIE_RXFNEIE_Msk   USART_CR1_RXFNEIE_Msk                      /*!< 0x00000020 */
#define USART_CR1_RXNEIE_RXFNEIE       USART_CR1_RXFNEIE_Msk                      /*!< RXNE and RX FIFO Not Empty Interrupt Enable */
#define USART_CR1_TCIE_Pos             (6U)
#define USART_CR1_TCIE_Msk             (0x1UL << USART_CR1_TCIE_Pos)/*!< 0x00000040 */
#define USART_CR1_TCIE                 USART_CR1_TCIE_Msk          /*!< Transmission complete interrupt enable */
#define USART_CR1_TXFNFIE_Pos          (7U)
#define USART_CR1_TXFNFIE_Msk          (0x1UL << USART_CR1_TXFNFIE_Pos)   /*!< 0x00000080 */
#define USART_CR1_TXFNFIE              USART_CR1_TXFNFIE_Msk       /*!< TXFIFO not full interrupt enable */
#define USART_CR1_TXEIE_TXFNFIE_Pos    USART_CR1_TXFNFIE_Pos
#define USART_CR1_TXEIE_TXFNFIE_Msk    USART_CR1_TXFNFIE_Msk                       /*!< 0x00000080 */
#define USART_CR1_TXEIE_TXFNFIE        USART_CR1_TXFNFIE_Msk                       /*!< TXE and TX FIFO Not Full Interrupt Enable */
#define USART_CR1_PEIE_Pos             (8U)
#define USART_CR1_PEIE_Msk             (0x1UL << USART_CR1_PEIE_Pos)/*!< 0x00000100 */
#define USART_CR1_PEIE                 USART_CR1_PEIE_Msk          /*!< PE interrupt enable */
#define USART_CR1_PS_Pos               (9U)
#define USART_CR1_PS_Msk               (0x1UL << USART_CR1_PS_Pos)  /*!< 0x00000200 */
#define USART_CR1_PS                   USART_CR1_PS_Msk            /*!< Parity selection */
#define USART_CR1_PCE_Pos              (10U)
#define USART_CR1_PCE_Msk              (0x1UL << USART_CR1_PCE_Pos) /*!< 0x00000400 */
#define USART_CR1_PCE                  USART_CR1_PCE_Msk           /*!< Parity control enable */
#define USART_CR1_WAKE_Pos             (11U)
#define USART_CR1_WAKE_Msk             (0x1UL << USART_CR1_WAKE_Pos)/*!< 0x00000800 */
#define USART_CR1_WAKE                 USART_CR1_WAKE_Msk          /*!< Receiver wakeup method */
#define USART_CR1_M_Pos                (12U)
#define USART_CR1_M_Msk                (0x10001UL << USART_CR1_M_Pos)             /*!< 0x10001000 */
#define USART_CR1_M                    USART_CR1_M_Msk                           /*!< Word length */
#define USART_CR1_M0_Pos               (12U)
#define USART_CR1_M0_Msk               (0x1UL << USART_CR1_M0_Pos)  /*!< 0x00001000 */
#define USART_CR1_M0                   USART_CR1_M0_Msk            /*!< Word length */
#define USART_CR1_MME_Pos              (13U)
#define USART_CR1_MME_Msk              (0x1UL << USART_CR1_MME_Pos) /*!< 0x00002000 */
#define USART_CR1_MME                  USART_CR1_MME_Msk           /*!< Mute mode enable */
#define USART_CR1_CMIE_Pos             (14U)
#define USART_CR1_CMIE_Msk             (0x1UL << USART_CR1_CMIE_Pos)/*!< 0x00004000 */
#define USART_CR1_CMIE                 USART_CR1_CMIE_Msk          /*!< Character match interrupt enable */
#define USART_CR1_OVER8_Pos            (15U)
#define USART_CR1_OVER8_Msk            (0x1UL << USART_CR1_OVER8_Pos) /*!< 0x00008000 */
#define USART_CR1_OVER8                USART_CR1_OVER8_Msk         /*!< Oversampling mode */
#define USART_CR1_DEDT_Pos             (16U)
#define USART_CR1_DEDT_Msk             (0x1FUL << USART_CR1_DEDT_Pos) /*!< 0x001F0000 */
#define USART_CR1_DEDT                 USART_CR1_DEDT_Msk          /*!< Driver Enable deassertion time */
#define USART_CR1_DEAT_Pos             (21U)
#define USART_CR1_DEAT_Msk             (0x1FUL << USART_CR1_DEAT_Pos) /*!< 0x03E00000 */
#define USART_CR1_DEAT                 USART_CR1_DEAT_Msk          /*!< Driver Enable assertion time */
#define USART_CR1_RTOIE_Pos            (26U)
#define USART_CR1_RTOIE_Msk            (0x1UL << USART_CR1_RTOIE_Pos) /*!< 0x04000000 */
#define USART_CR1_RTOIE                USART_CR1_RTOIE_Msk         /*!< Receiver timeout interrupt enable */
#define USART_CR1_EOBIE_Pos            (27U)
#define USART_CR1_EOBIE_Msk            (0x1UL << USART_CR1_EOBIE_Pos) /*!< 0x08000000 */
#define USART_CR1_EOBIE                USART_CR1_EOBIE_Msk         /*!< End of Block interrupt enable */
#define USART_CR1_M1_Pos               (28U)
#define USART_CR1_M1_Msk               (0x1UL << USART_CR1_M1_Pos)  /*!< 0x10000000 */
#define USART_CR1_M1                   USART_CR1_M1_Msk            /*!< Word length */
#define USART_CR1_FIFOEN_Pos           (29U)
#define USART_CR1_FIFOEN_Msk           (0x1UL << USART_CR1_FIFOEN_Pos)  /*!< 0x20000000 */
#define USART_CR1_FIFOEN               USART_CR1_FIFOEN_Msk        /*!< FIFO mode enable */
#define USART_CR1_TXFEIE_Pos           (30U)
#define USART_CR1_TXFEIE_Msk           (0x1UL << USART_CR1_TXFEIE_Pos)  /*!< 0x40000000 */
#define USART_CR1_TXFEIE               USART_CR1_TXFEIE_Msk        /*!< TXFIFO empty interrupt enable */
#define USART_CR1_RXFFIE_Pos           (31U)
#define USART_CR1_RXFFIE_Msk           (0x1UL << USART_CR1_RXFFIE_Pos)  /*!< 0x80000000 */
#define USART_CR1_RXFFIE               USART_CR1_RXFFIE_Msk        /*!< RXFIFO Full interrupt enable */

