STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp211cxx_cm33.h
#define USBH_EHCI_PORTSC_PED_Pos           (2U)
#define USBH_EHCI_PORTSC_PED_Msk           (0x1U << USBH_EHCI_PORTSC_PED_Pos)                /*!< 0x00000004 */
#define USBH_EHCI_PORTSC_PED               USBH_EHCI_PORTSC_PED_Msk                          /*!< Port Enabled/Disabled */

#define USBH_EHCI_PORTSC_PEC_Pos           (3U)
#define USBH_EHCI_PORTSC_PEC_Msk           (0x1U << USBH_EHCI_PORTSC_PEC_Pos)                /*!< 0x00000008 */
#define USBH_EHCI_PORTSC_PEC               USBH_EHCI_PORTSC_PEC_Msk                          /*!< Port Enable/Disable Change */

#define USBH_EHCI_PORTSC_OCA_Pos           (4U)
#define USBH_EHCI_PORTSC_OCA_Msk           (0x1U << USBH_EHCI_PORTSC_OCA_Pos)                /*!< 0x00000010 */
#define USBH_EHCI_PORTSC_OCA               USBH_EHCI_PORTSC_OCA_Msk                          /*!< Over-current Active */

#define USBH_EHCI_PORTSC_OCC_Pos           (5U)
#define USBH_EHCI_PORTSC_OCC_Msk           (0x1U << USBH_EHCI_PORTSC_OCC_Pos)                /*!< 0x00000020 */
#define USBH_EHCI_PORTSC_OCC               USBH_EHCI_PORTSC_OCC_Msk                          /*!< Over-current Change */

#define USBH_EHCI_PORTSC_FPR_Pos           (6U)
#define USBH_EHCI_PORTSC_FPR_Msk           (0x1U << USBH_EHCI_PORTSC_FPR_Pos)                /*!< 0x00000040 */
#define USBH_EHCI_PORTSC_FPR               USBH_EHCI_PORTSC_FPR_Msk                          /*!< Force Port Resume */

#define USBH_EHCI_PORTSC_SUSP_Pos          (7U)
#define USBH_EHCI_PORTSC_SUSP_Msk          (0x1U << USBH_EHCI_PORTSC_SUSP_Pos)               /*!< 0x00000080 */
#define USBH_EHCI_PORTSC_SUSP              USBH_EHCI_PORTSC_SUSP_Msk                         /*!< Suspend */

#define USBH_EHCI_PORTSC_PR_Pos            (8U)
#define USBH_EHCI_PORTSC_PR_Msk            (0x1U << USBH_EHCI_PORTSC_PR_Pos)                 /*!< 0x00000100 */
#define USBH_EHCI_PORTSC_PR                USBH_EHCI_PORTSC_PR_Msk                           /*!< Port Reset */

#define USBH_EHCI_PORTSC_SUSPEND_L1_Pos    (9U)
#define USBH_EHCI_PORTSC_SUSPEND_L1_Msk    (0x1U << USBH_EHCI_PORTSC_SUSPEND_L1_Pos)         /*!< 0x00000200 */
#define USBH_EHCI_PORTSC_SUSPEND_L1        USBH_EHCI_PORTSC_SUSPEND_L1_Msk                   /*!< Suspend using L1 */

#define USBH_EHCI_PORTSC_LS_Pos            (10U)
#define USBH_EHCI_PORTSC_LS_Msk            (0x3U << USBH_EHCI_PORTSC_LS_Pos)                 /*!< 0x00000C00 */
#define USBH_EHCI_PORTSC_LS                USBH_EHCI_PORTSC_LS_Msk                           /*!< Line Status */

#define USBH_EHCI_PORTSC_PP_Pos            (12U)
#define USBH_EHCI_PORTSC_PP_Msk            (0x1U << USBH_EHCI_PORTSC_PP_Pos)                 /*!< 0x00001000 */
#define USBH_EHCI_PORTSC_PP                USBH_EHCI_PORTSC_PP_Msk                           /*!< Port Power */

#define USBH_EHCI_PORTSC_PO_Pos            (13U)
#define USBH_EHCI_PORTSC_PO_Msk            (0x1U << USBH_EHCI_PORTSC_PO_Pos)                 /*!< 0x00002000 */
#define USBH_EHCI_PORTSC_PO                USBH_EHCI_PORTSC_PO_Msk                           /*!< Port Owner */

#define USBH_EHCI_PORTSC_PIC_Pos           (14U)
#define USBH_EHCI_PORTSC_PIC_Msk           (0x3U << USBH_EHCI_PORTSC_PIC_Pos)                /*!< 0x0000C000 */
#define USBH_EHCI_PORTSC_PIC               USBH_EHCI_PORTSC_PIC_Msk                          /*!< Port Indicator Control */

#define USBH_EHCI_PORTSC_PTC_Pos           (16U)
#define USBH_EHCI_PORTSC_PTC_Msk           (0xFU << USBH_EHCI_PORTSC_PTC_Pos)                /*!< 0x000F0000 */
#define USBH_EHCI_PORTSC_PTC               USBH_EHCI_PORTSC_PTC_Msk                          /*!< Port Test Control */

#define USBH_EHCI_PORTSC_WKCNNT_E_Pos      (20U)
#define USBH_EHCI_PORTSC_WKCNNT_E_Msk      (0x1U << USBH_EHCI_PORTSC_WKCNNT_E_Pos)           /*!< 0x00100000 */
#define USBH_EHCI_PORTSC_WKCNNT_E          USBH_EHCI_PORTSC_WKCNNT_E_Msk                     /*!< Wake on Connect Enable */

#define USBH_EHCI_PORTSC_WKDSCNNT_E_Pos    (21U)
#define USBH_EHCI_PORTSC_WKDSCNNT_E_Msk    (0x1U << USBH_EHCI_PORTSC_WKDSCNNT_E_Pos)         /*!< 0x00200000 */
#define USBH_EHCI_PORTSC_WKDSCNNT_E        USBH_EHCI_PORTSC_WKDSCNNT_E_Msk                   /*!< Wake on Disconnect Enable */

#define USBH_EHCI_PORTSC_WKOC_E_Pos        (22U)
#define USBH_EHCI_PORTSC_WKOC_E_Msk        (0x1U << USBH_EHCI_PORTSC_WKOC_E_Pos)             /*!< 0x00400000 */
#define USBH_EHCI_PORTSC_WKOC_E            USBH_EHCI_PORTSC_WKOC_E_Msk                       /*!< Wake on Over-current Enable */

#define USBH_EHCI_PORTSC_SUSPEND_STATUS_Pos (23U)
#define USBH_EHCI_PORTSC_SUSPEND_STATUS_Msk (0x3U << USBH_EHCI_PORTSC_SUSPEND_STATUS_Pos)    /*!< 0x01800000 */
#define USBH_EHCI_PORTSC_SUSPEND_STATUS    USBH_EHCI_PORTSC_SUSPEND_STATUS_Msk               /*!< Suspend Status */

#define USBH_EHCI_PORTSC_DEVICE_ADDR_Pos   (25U)
#define USBH_EHCI_PORTSC_DEVICE_ADDR_Msk   (0x7FU << USBH_EHCI_PORTSC_DEVICE_ADDR_Pos)       /*!< 0xFE000000 */
#define USBH_EHCI_PORTSC_DEVICE_ADDR       USBH_EHCI_PORTSC_DEVICE_ADDR_Msk                  /*!< Device Address */

/********************  Bit definition for USBH_EHCI_INSNREG01 register  **********************/
#define USBH_EHCI_INSNREG01_IN_THRESHOLD_Pos        (0U)
#define USBH_EHCI_INSNREG01_IN_THRESHOLD_Msk        (0xFFU << USBH_EHCI_INSNREG01_IN_THRESHOLD_Pos)            /*!< 0x000000FF */
#define USBH_EHCI_INSNREG01_IN_THRESHOLD            USBH_EHCI_INSNREG01_IN_THRESHOLD_Msk                       /*!< The value specified here is the number of 32-bit words */

#define USBH_EHCI_INSNREG01_OUT_THRESHOLD_Pos       (16U)
#define USBH_EHCI_INSNREG01_OUT_THRESHOLD_Msk       (0xFFU << USBH_EHCI_INSNREG01_OUT_THRESHOLD_Pos)           /*!< 0x00FF0000 */
#define USBH_EHCI_INSNREG01_OUT_THRESHOLD           USBH_EHCI_INSNREG01_OUT_THRESHOLD_Msk                      /*!< The value specified here is the number of 32-bit words */

/********************  Bit definition for USBH_EHCI_INSNREG02 register  **********************/
#define USBH_EHCI_INSNREG02_PKT_BUF_Pos             (0U)
#define USBH_EHCI_INSNREG02_PKT_BUF_Msk             (0xFFU << USBH_EHCI_INSNREG02_PKT_BUF_Pos)                 /*!< 0x000000FF */
#define USBH_EHCI_INSNREG02_PKT_BUF                 USBH_EHCI_INSNREG02_PKT_BUF_Msk                            /*!< Programmable packet buffer depth */

/********************  Bit definition for USBH_EHCI_INSNREG03 register  **********************/
#define USBH_EHCI_INSNREG03_BRK_MEM_TRANS_Pos       (0U)
#define USBH_EHCI_INSNREG03_BRK_MEM_TRANS_Msk       (0x1U << USBH_EHCI_INSNREG03_BRK_MEM_TRANS_Pos)            /*!< 0x00000001 */
#define USBH_EHCI_INSNREG03_BRK_MEM_TRANS           USBH_EHCI_INSNREG03_BRK_MEM_TRANS_Msk                      /*!< Break memory transfer */

#define USBH_EHCI_INSNREG03_TIME_AVAIL_OFF_Pos      (1U)
#define USBH_EHCI_INSNREG03_TIME_AVAIL_OFF_Msk      (0xFFU << USBH_EHCI_INSNREG03_TIME_AVAIL_OFF_Pos)          /*!< 0x000001FE */
#define USBH_EHCI_INSNREG03_TIME_AVAIL_OFF          USBH_EHCI_INSNREG03_TIME_AVAIL_OFF_Msk                     /*!< Time available offset */

#define USBH_EHCI_INSNREG03_FRM_LST_FETCH_Pos       (9U)
#define USBH_EHCI_INSNREG03_FRM_LST_FETCH_Msk       (0x1U << USBH_EHCI_INSNREG03_FRM_LST_FETCH_Pos)            /*!< 0x00000200 */
#define USBH_EHCI_INSNREG03_FRM_LST_FETCH           USBH_EHCI_INSNREG03_FRM_LST_FETCH_Msk                      /*!< Setting this bit will force the host controller to fetch the periodic frame list in every microfram */

#define USBH_EHCI_INSNREG03_TX_TRA_DELAY_Pos        (10U)
#define USBH_EHCI_INSNREG03_TX_TRA_DELAY_Msk        (0x7U << USBH_EHCI_INSNREG03_TX_TRA_DELAY_Pos)             /*!< 0x00001C00 */
#define USBH_EHCI_INSNREG03_TX_TRA_DELAY            USBH_EHCI_INSNREG03_TX_TRA_DELAY_Msk                       /*!< Tx-Tx turnaround delay add on */

#define USBH_EHCI_INSNREG03_TESTSE_NAK_Pos          (13U)
#define USBH_EHCI_INSNREG03_TESTSE_NAK_Msk          (0x1U << USBH_EHCI_INSNREG03_TESTSE_NAK_Pos)               /*!< 0x00002000 */
#define USBH_EHCI_INSNREG03_TESTSE_NAK              USBH_EHCI_INSNREG03_TESTSE_NAK_Msk                         /*!< TestSE NAK */

